TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw.h
/*
*
* Copyright (c) 2024-2025 Texas Instruments Incorporated
*
* All rights reserved not granted herein.
*
* Limited License.
*
* Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
* license under copyrights and patents it now or hereafter owns or controls to make,
* have made, use, import, offer to sell and sell ("Utilize") this software subject to the
* terms herein.  With respect to the foregoing patent license, such license is granted
* solely to the extent that any such patent is necessary to Utilize the software alone.
* The patent license shall not apply to any combinations which include this software,
* other than combinations with devices manufactured by or for TI ("TI Devices").
* No hardware patent is licensed hereunder.
*
* Redistributions must preserve existing copyright notices and reproduce this license
* (including the above copyright notice and the disclaimer and (if applicable) source
* code license limitations below) in the documentation and/or other materials provided
* with the distribution
*
* Redistribution and use in binary form, without modification, are permitted provided
* that the following conditions are met:
*
* *       No reverse engineering, decompilation, or disassembly of this software is
* permitted with respect to any software provided in binary form.
*
* *       any redistribution and use are licensed by TI for use only with TI Devices.
*
* *       Nothing shall obligate TI to provide you with source code for the software
* licensed and provided to you in object code.
*
* If software source code is provided to you, modification and redistribution of the
* source code are permitted provided that the following conditions are met:
*
* *       any redistribution and use of the source code, including any resulting derivative
* works, are licensed by TI for use only with TI Devices.
*
* *       any redistribution and use of any object code compiled from the source code
* and any resulting derivative works, are licensed by TI for use only with TI Devices.
*
* Neither the name of Texas Instruments Incorporated nor the names of its suppliers
*
* may be used to endorse or promote products derived from this software without
* specific prior written permission.
*
* DISCLAIMER.
*
* THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS
* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL TI AND TI'S LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
* BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
* DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
* OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
* OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
* OF THE POSSIBILITY OF SUCH DAMAGE.
*
*/

/**
 *  \file     Hw_Cpsw.h
 *
 *  \brief    This file contains the function prototypes for the device
 *            abstraction layer for CPSW subsystem. It also contains some
 *            related macro definitions and some files to be included.
 *
 *  \details  Please find the below detailed description of cpsw dal.
 */

#ifndef HW_CPSW_H_
#define HW_CPSW_H_

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Register Definitions
 ******************************************************************************/
#define CPSW_CPSW_ID_VER_REG                                     (0x00020000U)
#define CPSW_CONTROL_REG                                         (0x00020004U)
#define CPSW_EM_CONTROL_REG                                      (0x00020010U)
#define CPSW_STAT_PORT_EN_REG                                    (0x00020014U)
#define CPSW_PTYPE_REG                                           (0x00020018U)
#define CPSW_SOFT_IDLE_REG                                       (0x0002001CU)
#define CPSW_THRU_RATE_REG                                       (0x00020020U)
#define CPSW_GAP_THRESH_REG                                      (0x00020024U)
#define CPSW_TX_START_WDS_REG                                    (0x00020028U)
#define CPSW_EEE_PRESCALE_REG                                    (0x0002002CU)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG                           (0x00020030U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG                           (0x00020034U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG                           (0x00020038U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG                           (0x0002003CU)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG                           (0x00020040U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG                           (0x00020044U)
#define CPSW_VLAN_LTYPE_REG                                      (0x00020050U)
#define CPSW_EST_TS_DOMAIN_REG                                   (0x00020054U)
#define CPSW_TX_PRI0_MAXLEN_REG                                  (0x00020100U)
#define CPSW_TX_PRI1_MAXLEN_REG                                  (0x00020104U)
#define CPSW_TX_PRI2_MAXLEN_REG                                  (0x00020108U)
#define CPSW_TX_PRI3_MAXLEN_REG                                  (0x0002010CU)
#define CPSW_TX_PRI4_MAXLEN_REG                                  (0x00020110U)
#define CPSW_TX_PRI5_MAXLEN_REG                                  (0x00020114U)
#define CPSW_TX_PRI6_MAXLEN_REG                                  (0x00020118U)
#define CPSW_TX_PRI7_MAXLEN_REG                                  (0x0002011CU)
#define CPSW_EST_FETCH_LOC(FETCH_LOC)                    (0x00032000U+((FETCH_LOC)*0x4U))


/**************************************************************************
* Field Definition Macros
**************************************************************************/

/* FETCH_LOC */

#define CPSW_EST_FETCH_LOC_LOC_MASK                              (0x003FFFFFU)
#define CPSW_EST_FETCH_LOC_LOC_SHIFT                             (0x00000000U)
#define CPSW_EST_FETCH_LOC_LOC_MAX                               (0x003FFFFFU)

/* CPSW_ID_VER_REG */

