TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw.h
#define CPSW_CPSW_ID_VER_REG_MINOR_VER_MASK                      (0x0000003FU)
#define CPSW_CPSW_ID_VER_REG_MINOR_VER_SHIFT                     (0x00000000U)
#define CPSW_CPSW_ID_VER_REG_MINOR_VER_MAX                       (0x0000003FU)

#define CPSW_CPSW_ID_VER_REG_CUSTOM_VER_MASK                     (0x000000C0U)
#define CPSW_CPSW_ID_VER_REG_CUSTOM_VER_SHIFT                    (0x00000006U)
#define CPSW_CPSW_ID_VER_REG_CUSTOM_VER_MAX                      (0x00000003U)

#define CPSW_CPSW_ID_VER_REG_MAJOR_VER_MASK                      (0x00000700U)
#define CPSW_CPSW_ID_VER_REG_MAJOR_VER_SHIFT                     (0x00000008U)
#define CPSW_CPSW_ID_VER_REG_MAJOR_VER_MAX                       (0x00000007U)

#define CPSW_CPSW_ID_VER_REG_RTL_VER_MASK                        (0x0000F800U)
#define CPSW_CPSW_ID_VER_REG_RTL_VER_SHIFT                       (0x0000000BU)
#define CPSW_CPSW_ID_VER_REG_RTL_VER_MAX                         (0x0000001FU)

#define CPSW_CPSW_ID_VER_REG_IDENT_MASK                          (0xFFFF0000U)
#define CPSW_CPSW_ID_VER_REG_IDENT_SHIFT                         (0x00000010U)
#define CPSW_CPSW_ID_VER_REG_IDENT_MAX                           (0x0000FFFFU)

/* CONTROL_REG */

#define CPSW_CONTROL_REG_S_CN_SWITCH_MASK                        (0x00000001U)
#define CPSW_CONTROL_REG_S_CN_SWITCH_SHIFT                       (0x00000000U)
#define CPSW_CONTROL_REG_S_CN_SWITCH_MAX                         (0x00000001U)

#define CPSW_CONTROL_REG_VLAN_AWARE_MASK                         (0x00000002U)
#define CPSW_CONTROL_REG_VLAN_AWARE_SHIFT                        (0x00000001U)
#define CPSW_CONTROL_REG_VLAN_AWARE_MAX                          (0x00000001U)

#define CPSW_CONTROL_REG_P0_ENABLE_MASK                          (0x00000004U)
#define CPSW_CONTROL_REG_P0_ENABLE_SHIFT                         (0x00000002U)
#define CPSW_CONTROL_REG_P0_ENABLE_MAX                           (0x00000001U)

#define CPSW_CONTROL_REG_P0_PASS_PRI_TAGGED_MASK                 (0x00000008U)
#define CPSW_CONTROL_REG_P0_PASS_PRI_TAGGED_SHIFT                (0x00000003U)
#define CPSW_CONTROL_REG_P0_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P1_PASS_PRI_TAGGED_MASK                 (0x00000010U)
#define CPSW_CONTROL_REG_P1_PASS_PRI_TAGGED_SHIFT                (0x00000004U)
#define CPSW_CONTROL_REG_P1_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P2_PASS_PRI_TAGGED_MASK                 (0x00000020U)
#define CPSW_CONTROL_REG_P2_PASS_PRI_TAGGED_SHIFT                (0x00000005U)
#define CPSW_CONTROL_REG_P2_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P3_PASS_PRI_TAGGED_MASK                 (0x00000040U)
#define CPSW_CONTROL_REG_P3_PASS_PRI_TAGGED_SHIFT                (0x00000006U)
#define CPSW_CONTROL_REG_P3_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P4_PASS_PRI_TAGGED_MASK                 (0x00000080U)
#define CPSW_CONTROL_REG_P4_PASS_PRI_TAGGED_SHIFT                (0x00000007U)
#define CPSW_CONTROL_REG_P4_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P5_PASS_PRI_TAGGED_MASK                 (0x00000100U)
#define CPSW_CONTROL_REG_P5_PASS_PRI_TAGGED_SHIFT                (0x00000008U)
#define CPSW_CONTROL_REG_P5_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P6_PASS_PRI_TAGGED_MASK                 (0x00000200U)
#define CPSW_CONTROL_REG_P6_PASS_PRI_TAGGED_SHIFT                (0x00000009U)
#define CPSW_CONTROL_REG_P6_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P7_PASS_PRI_TAGGED_MASK                 (0x00000400U)
#define CPSW_CONTROL_REG_P7_PASS_PRI_TAGGED_SHIFT                (0x0000000AU)
#define CPSW_CONTROL_REG_P7_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P8_PASS_PRI_TAGGED_MASK                 (0x00000800U)
#define CPSW_CONTROL_REG_P8_PASS_PRI_TAGGED_SHIFT                (0x0000000BU)
#define CPSW_CONTROL_REG_P8_PASS_PRI_TAGGED_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_P0_TX_CRC_REMOVE_MASK                   (0x00002000U)
#define CPSW_CONTROL_REG_P0_TX_CRC_REMOVE_SHIFT                  (0x0000000DU)
#define CPSW_CONTROL_REG_P0_TX_CRC_REMOVE_MAX                    (0x00000001U)

#define CPSW_CONTROL_REG_P0_RX_PAD_MASK                          (0x00004000U)
#define CPSW_CONTROL_REG_P0_RX_PAD_SHIFT                         (0x0000000EU)
#define CPSW_CONTROL_REG_P0_RX_PAD_MAX                           (0x00000001U)

#define CPSW_CONTROL_REG_P0_RX_PASS_CRC_ERR_MASK                 (0x00008000U)
#define CPSW_CONTROL_REG_P0_RX_PASS_CRC_ERR_SHIFT                (0x0000000FU)
#define CPSW_CONTROL_REG_P0_RX_PASS_CRC_ERR_MAX                  (0x00000001U)

#define CPSW_CONTROL_REG_EEE_ENABLE_MASK                         (0x00010000U)
#define CPSW_CONTROL_REG_EEE_ENABLE_SHIFT                        (0x00000010U)
#define CPSW_CONTROL_REG_EEE_ENABLE_MAX                          (0x00000001U)

#define CPSW_CONTROL_REG_IET_ENABLE_MASK                         (0x00020000U)
#define CPSW_CONTROL_REG_IET_ENABLE_SHIFT                        (0x00000011U)
#define CPSW_CONTROL_REG_IET_ENABLE_MAX                          (0x00000001U)

#define CPSW_CONTROL_REG_EST_ENABLE_MASK                         (0x00040000U)
#define CPSW_CONTROL_REG_EST_ENABLE_SHIFT                        (0x00000012U)
#define CPSW_CONTROL_REG_EST_ENABLE_MAX                          (0x00000001U)

#define CPSW_CONTROL_REG_ECC_CRC_MODE_MASK                       (0x80000000U)
#define CPSW_CONTROL_REG_ECC_CRC_MODE_SHIFT                      (0x0000001FU)
#define CPSW_CONTROL_REG_ECC_CRC_MODE_MAX                        (0x00000001U)

/* EM_CONTROL_REG */

#define CPSW_EM_CONTROL_REG_FREE_MASK                            (0x00000001U)
#define CPSW_EM_CONTROL_REG_FREE_SHIFT                           (0x00000000U)
#define CPSW_EM_CONTROL_REG_FREE_MAX                             (0x00000001U)

#define CPSW_EM_CONTROL_REG_SOFT_MASK                            (0x00000002U)
#define CPSW_EM_CONTROL_REG_SOFT_SHIFT                           (0x00000001U)
#define CPSW_EM_CONTROL_REG_SOFT_MAX                             (0x00000001U)

/* STAT_PORT_EN_REG */

#define CPSW_STAT_PORT_EN_REG_P0_STAT_EN_MASK                    (0x00000001U)
#define CPSW_STAT_PORT_EN_REG_P0_STAT_EN_SHIFT                   (0x00000000U)
#define CPSW_STAT_PORT_EN_REG_P0_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P1_STAT_EN_MASK                    (0x00000002U)
#define CPSW_STAT_PORT_EN_REG_P1_STAT_EN_SHIFT                   (0x00000001U)
#define CPSW_STAT_PORT_EN_REG_P1_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P2_STAT_EN_MASK                    (0x00000004U)
#define CPSW_STAT_PORT_EN_REG_P2_STAT_EN_SHIFT                   (0x00000002U)
#define CPSW_STAT_PORT_EN_REG_P2_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P3_STAT_EN_MASK                    (0x00000008U)
#define CPSW_STAT_PORT_EN_REG_P3_STAT_EN_SHIFT                   (0x00000003U)
#define CPSW_STAT_PORT_EN_REG_P3_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P4_STAT_EN_MASK                    (0x00000010U)
#define CPSW_STAT_PORT_EN_REG_P4_STAT_EN_SHIFT                   (0x00000004U)
#define CPSW_STAT_PORT_EN_REG_P4_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P5_STAT_EN_MASK                    (0x00000020U)
#define CPSW_STAT_PORT_EN_REG_P5_STAT_EN_SHIFT                   (0x00000005U)
#define CPSW_STAT_PORT_EN_REG_P5_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P6_STAT_EN_MASK                    (0x00000040U)
#define CPSW_STAT_PORT_EN_REG_P6_STAT_EN_SHIFT                   (0x00000006U)
#define CPSW_STAT_PORT_EN_REG_P6_STAT_EN_MAX                     (0x00000001U)

