TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw.h
#define CPSW_STAT_PORT_EN_REG_P7_STAT_EN_MASK                    (0x00000080U)
#define CPSW_STAT_PORT_EN_REG_P7_STAT_EN_SHIFT                   (0x00000007U)
#define CPSW_STAT_PORT_EN_REG_P7_STAT_EN_MAX                     (0x00000001U)

#define CPSW_STAT_PORT_EN_REG_P8_STAT_EN_MASK                    (0x00000100U)
#define CPSW_STAT_PORT_EN_REG_P8_STAT_EN_SHIFT                   (0x00000008U)
#define CPSW_STAT_PORT_EN_REG_P8_STAT_EN_MAX                     (0x00000001U)

/* PTYPE_REG */

#define CPSW_PTYPE_REG_ESC_PRI_LD_VAL_MASK                       (0x0000001FU)
#define CPSW_PTYPE_REG_ESC_PRI_LD_VAL_SHIFT                      (0x00000000U)
#define CPSW_PTYPE_REG_ESC_PRI_LD_VAL_MAX                        (0x0000001FU)

#define CPSW_PTYPE_REG_P0_PTYPE_ESC_MASK                         (0x00000100U)
#define CPSW_PTYPE_REG_P0_PTYPE_ESC_SHIFT                        (0x00000008U)
#define CPSW_PTYPE_REG_P0_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P1_PTYPE_ESC_MASK                         (0x00000200U)
#define CPSW_PTYPE_REG_P1_PTYPE_ESC_SHIFT                        (0x00000009U)
#define CPSW_PTYPE_REG_P1_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P2_PTYPE_ESC_MASK                         (0x00000400U)
#define CPSW_PTYPE_REG_P2_PTYPE_ESC_SHIFT                        (0x0000000AU)
#define CPSW_PTYPE_REG_P2_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P3_PTYPE_ESC_MASK                         (0x00000800U)
#define CPSW_PTYPE_REG_P3_PTYPE_ESC_SHIFT                        (0x0000000BU)
#define CPSW_PTYPE_REG_P3_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P4_PTYPE_ESC_MASK                         (0x00001000U)
#define CPSW_PTYPE_REG_P4_PTYPE_ESC_SHIFT                        (0x0000000CU)
#define CPSW_PTYPE_REG_P4_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P5_PTYPE_ESC_MASK                         (0x00002000U)
#define CPSW_PTYPE_REG_P5_PTYPE_ESC_SHIFT                        (0x0000000DU)
#define CPSW_PTYPE_REG_P5_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P6_PTYPE_ESC_MASK                         (0x00004000U)
#define CPSW_PTYPE_REG_P6_PTYPE_ESC_SHIFT                        (0x0000000EU)
#define CPSW_PTYPE_REG_P6_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P7_PTYPE_ESC_MASK                         (0x00008000U)
#define CPSW_PTYPE_REG_P7_PTYPE_ESC_SHIFT                        (0x0000000FU)
#define CPSW_PTYPE_REG_P7_PTYPE_ESC_MAX                          (0x00000001U)

#define CPSW_PTYPE_REG_P8_PTYPE_ESC_MASK                         (0x00010000U)
#define CPSW_PTYPE_REG_P8_PTYPE_ESC_SHIFT                        (0x00000010U)
#define CPSW_PTYPE_REG_P8_PTYPE_ESC_MAX                          (0x00000001U)

/* SOFT_IDLE_REG */

#define CPSW_SOFT_IDLE_REG_SOFT_IDLE_MASK                        (0x00000001U)
#define CPSW_SOFT_IDLE_REG_SOFT_IDLE_SHIFT                       (0x00000000U)
#define CPSW_SOFT_IDLE_REG_SOFT_IDLE_MAX                         (0x00000001U)

/* THRU_RATE_REG */

#define CPSW_THRU_RATE_REG_P0_RX_THRU_RATE_MASK                  (0x0000000FU)
#define CPSW_THRU_RATE_REG_P0_RX_THRU_RATE_SHIFT                 (0x00000000U)
#define CPSW_THRU_RATE_REG_P0_RX_THRU_RATE_MAX                   (0x0000000FU)

#define CPSW_THRU_RATE_REG_SL_RX_THRU_RATE_MASK                  (0x0000F000U)
#define CPSW_THRU_RATE_REG_SL_RX_THRU_RATE_SHIFT                 (0x0000000CU)
#define CPSW_THRU_RATE_REG_SL_RX_THRU_RATE_MAX                   (0x0000000FU)

/* GAP_THRESH_REG */

#define CPSW_GAP_THRESH_REG_GAP_THRESH_MASK                      (0x0000001FU)
#define CPSW_GAP_THRESH_REG_GAP_THRESH_SHIFT                     (0x00000000U)
#define CPSW_GAP_THRESH_REG_GAP_THRESH_MAX                       (0x0000001FU)

/* TX_START_WDS_REG */

#define CPSW_TX_START_WDS_REG_TX_START_WDS_MASK                  (0x000007FFU)
#define CPSW_TX_START_WDS_REG_TX_START_WDS_SHIFT                 (0x00000000U)
#define CPSW_TX_START_WDS_REG_TX_START_WDS_MAX                   (0x000007FFU)

/* EEE_PRESCALE_REG */

#define CPSW_EEE_PRESCALE_REG_EEE_PRESCALE_MASK                  (0x00000FFFU)
#define CPSW_EEE_PRESCALE_REG_EEE_PRESCALE_SHIFT                 (0x00000000U)
#define CPSW_EEE_PRESCALE_REG_EEE_PRESCALE_MAX                   (0x00000FFFU)

/* TX_G_OFLOW_THRESH_SET_REG */

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI0_MASK                 (0x0000000FU)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI0_SHIFT                (0x00000000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI0_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI1_MASK                 (0x000000F0U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI1_SHIFT                (0x00000004U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI1_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI2_MASK                 (0x00000F00U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI2_SHIFT                (0x00000008U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI2_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI3_MASK                 (0x0000F000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI3_SHIFT                (0x0000000CU)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI3_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI4_MASK                 (0x000F0000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI4_SHIFT                (0x00000010U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI4_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI5_MASK                 (0x00F00000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI5_SHIFT                (0x00000014U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI5_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI6_MASK                 (0x0F000000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI6_SHIFT                (0x00000018U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI6_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI7_MASK                 (0xF0000000U)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI7_SHIFT                (0x0000001CU)
#define CPSW_TX_G_OFLOW_THRESH_SET_REG_PRI7_MAX                  (0x0000000FU)

