TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw.h
/* TX_G_OFLOW_THRESH_CLR_REG */

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI0_MASK                 (0x0000000FU)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI0_SHIFT                (0x00000000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI0_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI1_MASK                 (0x000000F0U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI1_SHIFT                (0x00000004U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI1_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI2_MASK                 (0x00000F00U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI2_SHIFT                (0x00000008U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI2_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI3_MASK                 (0x0000F000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI3_SHIFT                (0x0000000CU)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI3_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI4_MASK                 (0x000F0000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI4_SHIFT                (0x00000010U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI4_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI5_MASK                 (0x00F00000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI5_SHIFT                (0x00000014U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI5_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI6_MASK                 (0x0F000000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI6_SHIFT                (0x00000018U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI6_MAX                  (0x0000000FU)

#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI7_MASK                 (0xF0000000U)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI7_SHIFT                (0x0000001CU)
#define CPSW_TX_G_OFLOW_THRESH_CLR_REG_PRI7_MAX                  (0x0000000FU)

/* TX_G_BUF_THRESH_SET_L_REG */

#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI0_MASK                 (0x000000FFU)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI0_SHIFT                (0x00000000U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI0_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI1_MASK                 (0x0000FF00U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI1_SHIFT                (0x00000008U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI1_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI2_MASK                 (0x00FF0000U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI2_SHIFT                (0x00000010U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI2_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI3_MASK                 (0xFF000000U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI3_SHIFT                (0x00000018U)
#define CPSW_TX_G_BUF_THRESH_SET_L_REG_PRI3_MAX                  (0x000000FFU)

/* TX_G_BUF_THRESH_SET_H_REG */

#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI4_MASK                 (0x000000FFU)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI4_SHIFT                (0x00000000U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI4_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI5_MASK                 (0x0000FF00U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI5_SHIFT                (0x00000008U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI5_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI6_MASK                 (0x00FF0000U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI6_SHIFT                (0x00000010U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI6_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI7_MASK                 (0xFF000000U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI7_SHIFT                (0x00000018U)
#define CPSW_TX_G_BUF_THRESH_SET_H_REG_PRI7_MAX                  (0x000000FFU)

/* TX_G_BUF_THRESH_CLR_L_REG */

#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MASK                 (0x000000FFU)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI0_SHIFT                (0x00000000U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MASK                 (0x0000FF00U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI1_SHIFT                (0x00000008U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MASK                 (0x00FF0000U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI2_SHIFT                (0x00000010U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MASK                 (0xFF000000U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI3_SHIFT                (0x00000018U)
#define CPSW_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MAX                  (0x000000FFU)

/* TX_G_BUF_THRESH_CLR_H_REG */

#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MASK                 (0x000000FFU)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI4_SHIFT                (0x00000000U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MASK                 (0x0000FF00U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI5_SHIFT                (0x00000008U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MASK                 (0x00FF0000U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI6_SHIFT                (0x00000010U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MAX                  (0x000000FFU)

#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MASK                 (0xFF000000U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI7_SHIFT                (0x00000018U)
#define CPSW_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MAX                  (0x000000FFU)

/* VLAN_LTYPE_REG */

#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_INNER_MASK                (0x0000FFFFU)
#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_INNER_SHIFT               (0x00000000U)
#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_INNER_MAX                 (0x0000FFFFU)

#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_OUTER_MASK                (0xFFFF0000U)
#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_OUTER_SHIFT               (0x00000010U)
#define CPSW_VLAN_LTYPE_REG_VLAN_LTYPE_OUTER_MAX                 (0x0000FFFFU)

/* EST_TS_DOMAIN_REG */

#define CPSW_EST_TS_DOMAIN_REG_EST_TS_DOMAIN_MASK                (0x000000FFU)
#define CPSW_EST_TS_DOMAIN_REG_EST_TS_DOMAIN_SHIFT               (0x00000000U)
#define CPSW_EST_TS_DOMAIN_REG_EST_TS_DOMAIN_MAX                 (0x000000FFU)

