TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw.h
/* TX_PRI0_MAXLEN_REG */

#define CPSW_TX_PRI0_MAXLEN_REG_TX_PRI0_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI0_MAXLEN_REG_TX_PRI0_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI0_MAXLEN_REG_TX_PRI0_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI1_MAXLEN_REG */

#define CPSW_TX_PRI1_MAXLEN_REG_TX_PRI1_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI1_MAXLEN_REG_TX_PRI1_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI1_MAXLEN_REG_TX_PRI1_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI2_MAXLEN_REG */

#define CPSW_TX_PRI2_MAXLEN_REG_TX_PRI2_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI2_MAXLEN_REG_TX_PRI2_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI2_MAXLEN_REG_TX_PRI2_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI3_MAXLEN_REG */

#define CPSW_TX_PRI3_MAXLEN_REG_TX_PRI3_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI3_MAXLEN_REG_TX_PRI3_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI3_MAXLEN_REG_TX_PRI3_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI4_MAXLEN_REG */

#define CPSW_TX_PRI4_MAXLEN_REG_TX_PRI4_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI4_MAXLEN_REG_TX_PRI4_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI4_MAXLEN_REG_TX_PRI4_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI5_MAXLEN_REG */

#define CPSW_TX_PRI5_MAXLEN_REG_TX_PRI5_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI5_MAXLEN_REG_TX_PRI5_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI5_MAXLEN_REG_TX_PRI5_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI6_MAXLEN_REG */

#define CPSW_TX_PRI6_MAXLEN_REG_TX_PRI6_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI6_MAXLEN_REG_TX_PRI6_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI6_MAXLEN_REG_TX_PRI6_MAXLEN_MAX               (0x00003FFFU)

/* TX_PRI7_MAXLEN_REG */

#define CPSW_TX_PRI7_MAXLEN_REG_TX_PRI7_MAXLEN_MASK              (0x00003FFFU)
#define CPSW_TX_PRI7_MAXLEN_REG_TX_PRI7_MAXLEN_SHIFT             (0x00000000U)
#define CPSW_TX_PRI7_MAXLEN_REG_TX_PRI7_MAXLEN_MAX               (0x00003FFFU)

/* CPSW_SS_IDVER_REG */

#define CPSW_SS_IDVER_REG_MINOR_VER_MASK                          (0x000000FFU)
#define CPSW_SS_IDVER_REG_MINOR_VER_SHIFT                         (0x00000000U)
#define CPSW_SS_IDVER_REG_MINOR_VER_MAX                           (0x000000FFU)

#define CPSW_SS_IDVER_REG_MAJOR_VER_MASK                          (0x00000700U)
#define CPSW_SS_IDVER_REG_MAJOR_VER_SHIFT                         (0x00000008U)
#define CPSW_SS_IDVER_REG_MAJOR_VER_MAX                           (0x00000007U)

#define CPSW_SS_IDVER_REG_RTL_VER_MASK                            (0x0000F800U)
#define CPSW_SS_IDVER_REG_RTL_VER_SHIFT                           (0x0000000BU)
#define CPSW_SS_IDVER_REG_RTL_VER_MAX                             (0x0000001FU)

#define CPSW_SS_IDVER_REG_IDENT_MASK                              (0xFFFF0000U)
#define CPSW_SS_IDVER_REG_IDENT_SHIFT                             (0x00000010U)
#define CPSW_SS_IDVER_REG_IDENT_MAX                               (0x0000FFFFU)

/* SYNCE_COUNT_REG */

#define SYNCE_COUNT_REG_SYNCE_CNT_MASK                            (0xFFFFFFFFU)
#define SYNCE_COUNT_REG_SYNCE_CNT_SHIFT                           (0x00000000U)
#define SYNCE_COUNT_REG_SYNCE_CNT_MAX                             (0xFFFFFFFFU)

/* SYNCE_MUX_REG */

#define SYNCE_MUX_REG_SYNCE_SEL_MASK                              (0x0000003FU)
#define SYNCE_MUX_REG_SYNCE_SEL_SHIFT                             (0x00000000U)
#define SYNCE_MUX_REG_SYNCE_SEL_MAX                               (0x0000003FU)

/* CONTROL_REG */

#define CONTROL_REG_EEE_EN_MASK                                   (0x00000001U)
#define CONTROL_REG_EEE_EN_SHIFT                                  (0x00000000U)
#define CONTROL_REG_EEE_EN_MAX                                    (0x00000001U)

#define CONTROL_REG_EEE_PHY_ONLY_MASK                             (0x00000002U)
#define CONTROL_REG_EEE_PHY_ONLY_SHIFT                            (0x00000001U)
#define CONTROL_REG_EEE_PHY_ONLY_MAX                              (0x00000001U)

/* SGMII_MODE_REG */

#define SGMII_MODE_REG_SYNCE_SEL_MASK                             (0x00000001U)
#define SGMII_MODE_REG_SYNCE_SEL_SHIFT                            (0x00000000U)
#define SGMII_MODE_REG_SYNCE_SEL_MAX                              (0x00000001U)

/* RGMII_STATUS_REG */

#define RGMII_STATUS_REG_LINK_MASK                                (0x00000001U)
#define RGMII_STATUS_REG_LINK_SHIFT                               (0x00000000U)
#define RGMII_STATUS_REG_LINK_MAX                                 (0x00000001U)

#define RGMII_STATUS_REG_SPEED_MASK                               (0x00000006U)
#define RGMII_STATUS_REG_SPEED_SHIFT                              (0x00000001U)
#define RGMII_STATUS_REG_SPEED_MAX                                (0x00000003U)

#define RGMII_STATUS_REG_FULLDUPLEX_MASK                          (0x00000008U)
#define RGMII_STATUS_REG_FULLDUPLEX_SHIFT                         (0x00000003U)
#define RGMII_STATUS_REG_FULLDUPLEX_MAX                           (0x00000001U)

/* SUBSSYSTEM_STATUS_REG */

#define SUBSSYSTEM_STATUS_REG_EEE_CLKSTOP_ACK_MASK                (0x00000001U)
#define SUBSSYSTEM_STATUS_REG_EEE_CLKSTOP_ACK_SHIFT               (0x00000000U)
#define SUBSSYSTEM_STATUS_REG_EEE_CLKSTOP_ACK_MAX                 (0x00000001U)

#ifdef __cplusplus
}
#endif

#endif /* #ifndef HW_CPSW_H_ */
